-- Modified by fsworld009
-- Original Author: Appendko https://github.com/Appendko

item_log = {}

local itemNameforLog = {
[0x000] = "[1]生命提升",
[0x010] = "[1]能源提升",
[0x024] = "[1]E罐",
[0x028] = "[1]武器: 魚雷章魚",
[0x029] = "[1]武器: 針刺變色龍",
[0x02A] = "[1]武器: 裝甲犰狳",
[0x02B] = "[1]武器: 燃燒猛獁",
[0x02C] = "[1]武器: 暴風鐵鷹",
[0x02D] = "[1]武器: 火花山魈",
[0x02E] = "[1]武器: 回力鏢鍬型蟲",
[0x02F] = "[1]武器: 冰凍企鵝",
[0x030] = "[1]鑰匙: 魚雷章魚",
[0x031] = "[1]鑰匙: 針刺變色龍",
[0x032] = "[1]鑰匙: 裝甲犰狳",
[0x033] = "[1]鑰匙: 燃燒猛獁",
[0x034] = "[1]鑰匙: 暴風鐵鷹",
[0x035] = "[1]鑰匙: 火花山魈",
[0x036] = "[1]鑰匙: 回力鏢鍬型蟲",
[0x037] = "[1]鑰匙: 冰凍企鵝",
[0x039] = "[1]變化: 針刺變色龍 關卡變化",
[0x03B] = "[1]變化: 燃燒猛獁 關卡變化",
[0x03D] = "[1]變化: 火花山魈 關卡變化",
[0x040] = "[1]西格瑪鑰匙",
[0x050] = "[1]波動拳",
[0x058] = "[1]頭部裝備",
[0x05A] = "[1]手部裝備",
[0x05C] = "[1]身體裝備",
[0x05E] = "[1]腳部裝備",
[0x060] = "[1]X飛彈數量上升",
[0x065] = "[1]X飛彈威力強化",
[0x068] = "[1]X飛彈連發速率強化",
[0x06E] = "[1]衝刺飛彈數量上升",
[0x070] = "[1]蓄力速度加快",

[0x100] = "[2]生命提升",
[0x110] = "[2]能源提升",
[0x124] = "[2]E罐",
[0x128] = "[2]武器: 變型飛蛾",
[0x129] = "[2]武器: 鋼索絲瓜",
[0x12A] = "[2]武器: 泡沫螃蟹",
[0x12B] = "[2]武器: 烈焰雄鹿",
[0x12C] = "[2]武器: 磁石蜈蚣",
[0x12D] = "[2]武器: 水晶蝸牛",
[0x12E] = "[2]武器: 音速鴕鳥",
[0x12F] = "[2]武器: 車輪短吻鱷",
[0x130] = "[2]鑰匙: 變型飛蛾",
[0x131] = "[2]鑰匙: 鋼索絲瓜",
[0x132] = "[2]鑰匙: 泡沫螃蟹",
[0x133] = "[2]鑰匙: 烈焰雄鹿",
[0x134] = "[2]鑰匙: 磁石蜈蚣",
[0x135] = "[2]鑰匙: 水晶蝸牛",
[0x136] = "[2]鑰匙: 音速鴕鳥",
[0x137] = "[2]鑰匙: 車輪短吻鱷",
[0x138] = "[2]傑洛腳部零件",
[0x139] = "[2]傑洛頭部零件",
[0x13A] = "[2]傑洛身體零件",
[0x140] = "[2]西格瑪鑰匙",
[0x150] = "[2]昇龍拳",
[0x158] = "[2]頭部裝備",
[0x15A] = "[2]手部裝備",
[0x15C] = "[2]身體裝備",
[0x15E] = "[2]腳部裝備",
[0x160] = "[2]X飛彈數量上升",
[0x165] = "[2]X飛彈威力強化",
[0x168] = "[2]X飛彈連發速率強化",
[0x16E] = "[2]衝刺飛彈數量上升",
[0x170] = "[2]蓄力速度加快",

[0x200] = "[3]生命提升",
[0x210] = "[3]能源提升",
[0x224] = "[3]E罐",
[0x228] = "[3]武器: 爆破黃蜂",
[0x229] = "[3]武器: 冰凍水牛",
[0x22A] = "[3]武器: 重力獨角仙",
[0x22B] = "[3]武器: 酸性海馬",
[0x22C] = "[3]武器: 電氣鯰魚",
[0x22D] = "[3]武器: 剪刀蝦",
[0x22E] = "[3]武器: 螺旋犀牛",
[0x22F] = "[3]武器: 閃光虎",
[0x230] = "[3]鑰匙: 爆破黃蜂",
[0x231] = "[3]鑰匙: 冰凍水牛",
[0x232] = "[3]鑰匙: 重力獨角仙",
[0x233] = "[3]鑰匙: 酸性海馬",
[0x234] = "[3]鑰匙: 電氣鯰魚",
[0x235] = "[3]鑰匙: 剪刀蝦",
[0x236] = "[3]鑰匙: 螺旋犀牛",
[0x237] = "[3]鑰匙: 閃光虎",
[0x238] = "[3]變化: 爆破黃蜂 關卡變化",
[0x239] = "[3]變化: 冰凍水牛 關卡變化",
[0x23A] = "[3]變化: 重力獨角仙 關卡變化",
[0x23C] = "[3]鑰匙: 霸法",
[0x23D] = "[3]變化: 擊殺瓦傑里拉FF",
[0x23E] = "[3]變化: 擊殺曼達雷拉BB",
[0x23F] = "[3]變化: 擊殺霸法",
[0x240] = "[3]西格瑪鑰匙",
[0x250] = "[3]Z光束刀",
[0x254] = "[3]騎乘裝甲-N-嵌合獸號",
[0x255] = "[3]騎乘裝甲-K-袋鼠號",
[0x256] = "[3]騎乘裝甲-H-飛鷹號",
[0x257] = "[3]騎乘裝甲-F-雨蛙號",
[0x258] = "[3]頭部裝備",
[0x25A] = "[3]手部裝備",
[0x25C] = "[3]身體裝備",
[0x25E] = "[3]腳部裝備",
[0x260] = "[3]X飛彈數量上升",
[0x265] = "[3]X飛彈威力強化",
[0x268] = "[3]X飛彈連發速率強化",
[0x26E] = "[3]衝刺飛彈數量上升",
[0x270] = "[3]蓄力速度加快",

[0x300] = "[*]生命提升",
[0x310] = "[*]能源提升",
[0x324] = "[*]E罐",
[0x328] = "[*]武器: A",
[0x329] = "[*]武器: B",
[0x32A] = "[*]武器: C",
[0x32B] = "[*]武器: D",
[0x32C] = "[*]武器: E",
[0x32D] = "[*]武器: F",
[0x32E] = "[*]武器: G",
[0x32F] = "[*]武器: H",
[0x330] = "[*]鑰匙: I",
[0x331] = "[*]鑰匙: J",
[0x332] = "[*]鑰匙: K",
[0x333] = "[*]鑰匙: L",
[0x334] = "[*]鑰匙: M",
[0x335] = "[*]鑰匙: N",
[0x336] = "[*]鑰匙: O",
[0x337] = "[*]鑰匙: P",
[0x340] = "[*]西格瑪鑰匙",
[0x350] = "[*]???",
[0x358] = "[*]頭部裝備",
[0x35A] = "[*]手部裝備",
[0x35C] = "[*]身體裝備",
[0x35E] = "[*]腳部裝備",
[0x360] = "[*]X飛彈數量上升",
[0x365] = "[*]X飛彈威力強化",
[0x368] = "[*]X飛彈連發速率強化",
[0x36E] = "[*]衝刺飛彈數量上升",
[0x370] = "[*]蓄力速度加快",

}

for t=0,3,1 do
	local src = t * 0x100
	for i=1,0xD,1 do
		local dest = t * 0x100 + i
		itemNameforLog[ dest + 0x00 ] = itemNameforLog[ src + 0x00 ]
		itemNameforLog[ dest + 0x10 ] = itemNameforLog[ src + 0x10 ]
	end
	for i=1,0xC,1 do
		local dest = t * 0x100 + i
		itemNameforLog[ dest + 0x40 ] = itemNameforLog[ src + 0x40 ]
	end
	for i=1,0x3,1 do
		local dest = t * 0x100 + i
		itemNameforLog[ dest + 0x24 ] = itemNameforLog[ src + 0x24 ]
	end
	itemNameforLog[ src + 0x59 ] = itemNameforLog[ src + 0x58 ]
	itemNameforLog[ src + 0x5B ] = itemNameforLog[ src + 0x5A ]
	itemNameforLog[ src + 0x5D ] = itemNameforLog[ src + 0x5C ]
	itemNameforLog[ src + 0x5F ] = itemNameforLog[ src + 0x5E ]
	for i=1,0x4,1 do
		local dest = t * 0x100 + i
		itemNameforLog[ dest + 0x60 ] = itemNameforLog[ src + 0x60 ]
	end
	itemNameforLog[ src + 0x66 ] = itemNameforLog[ src + 0x65 ]
	for i=1,0x5,1 do
		local dest = t * 0x100 + i
		itemNameforLog[ dest + 0x68 ] = itemNameforLog[ src + 0x68 ]
	end
	itemNameforLog[ src + 0x6F ] = itemNameforLog[ src + 0x6E ]
	for i=1,0x3,1 do
		local dest = t * 0x100 + i
		itemNameforLog[ dest + 0x70 ] = itemNameforLog[ src + 0x70 ]
	end
end

local item_log_file = ""

function item_log.initialize_textlog(path)
  console.clear()
	item_log_file = path
  local file = io.open(item_log_file,"w")
  file:close()
end

function item_log.get_item_textlog(item_num)
  local str = itemNameforLog[item_num]
  console.log(str)
  local file = io.open(item_log_file,"a")
  file:write(string.format("%s\n",str))
  file:close()
end
